vlm/extension/Documents/СменноеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СменноеЗадание</Name>
		</Properties>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ПроизводственнаяОперация2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводственнаяОперация2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СрокСдачиЗаказчику</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ДатаРасчетаСрокаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ОбщийСрокИзготовленияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_СрокИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/СменноеЗадание/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТекстЗапросаОперацииДокумент() Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [19.08.2025 16:18:16] +        
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ОперацииПереопределяемый.Этап КАК ЭтапДоп,
	        |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ КАК ЗаказКлиента
	        |ПОМЕСТИТЬ втЗаказыКлиентаВсе
	        |ИЗ
	        |	Документ.ПроизводственнаяОперация2_2 КАК ОперацииПереопределяемый
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	        |		ПО ОперацииПереопределяемый.Этап = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
	        |ГДЕ
	        |	НЕ ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ЭтапДоп
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	втЗаказыКлиентаВсе.ЭтапДоп КАК ЭтапДоп,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втЗаказыКлиентаВсе.ЗаказКлиента) КАК ЗаказКлиента
	        |ПОМЕСТИТЬ втОдинЭтапОдинЗаказ
	        |ИЗ
	        |	втЗаказыКлиентаВсе КАК втЗаказыКлиентаВсе
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	втЗаказыКлиентаВсе.ЭтапДоп
	        |
	        |ИМЕЮЩИЕ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втЗаказыКлиентаВсе.ЗаказКлиента) = 1
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ЭтапДоп
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_ЗначенияПоУмолчаниюЗначения.Значение КАК Значение
	        |ПОМЕСТИТЬ ВидыГП
	        |ИЗ
	        |	Справочник.бит_ЗначенияПоУмолчанию.Значения КАК бит_ЗначенияПоУмолчаниюЗначения
	        |ГДЕ
	        |	бит_ЗначенияПоУмолчаниюЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.бит_ЗначенияПоУмолчанию.ВидыНоменклатурыГотовойПродукцииВПроизводственнойОперации)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бит_СерииЭтикетокВСменномЗадании.ПроизводственнаяОперация КАК ПроизводственнаяОперация,
	        |	СУММА(бит_СерииЭтикетокВСменномЗадании.СерияНоменклатуры.бит_МассаНетто) КАК МассаНеттоКг
	        |ПОМЕСТИТЬ втСерииМассаНетто
	        |ИЗ
	        |	РегистрСведений.бит_СерииЭтикетокВСменномЗадании КАК бит_СерииЭтикетокВСменномЗадании
	        |ГДЕ
	        |	бит_СерииЭтикетокВСменномЗадании.СерияНоменклатуры.бит_Завешено
	        |	И бит_СерииЭтикетокВСменномЗадании.СерияНоменклатуры.ВидНоменклатуры В ИЕРАРХИИ
	        |			(ВЫБРАТЬ
	        |				видыгп.Значение
	        |			ИЗ
	        |				видыгп)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бит_СерииЭтикетокВСменномЗадании.ПроизводственнаяОперация
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ПроизводственнаяОперация
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОперацииПереопределяемый.Ссылка КАК Ссылка,
	        |	ОперацииПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	        |	ОперацииПереопределяемый.Номер КАК Номер,
	        |	ОперацииПереопределяемый.Дата КАК Дата,
	        |	ОперацииПереопределяемый.Проведен КАК Проведен,
	        |	ОперацииПереопределяемый.Этап КАК Этап,
	        |	ОперацииПереопределяемый.Операция КАК Операция,
	        |	ОперацииПереопределяемый.ИдентификаторОперации КАК ИдентификаторОперации,
	        |	ОперацииПереопределяемый.Статус КАК Статус,
	        |	ОперацииПереопределяемый.Подразделение КАК Подразделение,
	        |	ОперацииПереопределяемый.Исполнитель КАК Исполнитель,
	        |	ОперацииПереопределяемый.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	        |	ОперацииПереопределяемый.РабочийЦентр КАК РабочийЦентр,
	        |	ОперацииПереопределяемый.ВариантНаладки КАК ВариантНаладки,
	        |	ОперацииПереопределяемый.Количество - ОперацииПереопределяемый.КоличествоОтменено КАК Количество,
	        |	ОперацииПереопределяемый.КоличествоНаКонтроле КАК КоличествоНаКонтроле,
	        |	ОперацииПереопределяемый.КоличествоНаДоработке КАК КоличествоНаДоработке,
	        |	ОперацииПереопределяемый.КоличествоБрак КАК КоличествоБрак,
	        |	ОперацииПереопределяемый.КоличествоФакт КАК КоличествоФакт,
	        |	ОперацииПереопределяемый.ВремяВыполнения КАК ВремяВыполнения,
	        |	ОперацииПереопределяемый.ВремяВыполненияЕдИзм КАК ВремяВыполненияЕдИзм,
	        |	ОперацииПереопределяемый.Ответственный КАК Ответственный,
	        |	ОперацииПереопределяемый.Комментарий КАК Комментарий,
	        |	ОперацииПереопределяемый.ОкончаниеВыполнения КАК ОкончаниеВыполнения,
	        |	ОперацииПереопределяемый.НомерОперацииЭтапа КАК НомерОперацииЭтапа,
	        |	ОперацииПереопределяемый.НомерПартии КАК НомерПартии,
	        |	ОперацииПереопределяемый.НаОснованииПланирования КАК НаОснованииПланирования,
	        |	ОперацииПереопределяемый.НаОснованииНСИ КАК НаОснованииНСИ,
	        |	ОперацииПереопределяемый.СменноеЗадание КАК СменноеЗадание,
	        |	ОперацииПереопределяемый.Наименование КАК Наименование,
	        |	ОперацииПереопределяемый.ТребуетПовторения КАК ТребуетПовторения,
	        |	ОперацииПереопределяемый.МожноПропустить КАК МожноПропустить,
	        |	ОперацииПереопределяемый.Контроль КАК Контроль,
	        |	&ПредставлениеЭтапа КАК ПредставлениеЭтапа,
			|	ОперацииПереопределяемый.бит_Транслировано КАК бит_Транслировано,
	        |	ЕСТЬNULL(влКомментарийЗаказаКлиента.бит_КомментарийЗаказаКлиента, """") КАК бит_КомментарийЗаказаКлиента,
	        |	ЕСТЬNULL(бит_ОчередностьОперацийВСменномЗадании.бит_Очередность, 0) КАК бит_Очередность,
	        |	ЕСТЬNULL(втСерииМассаНетто.МассаНеттоКг, 0) КАК бит_МассаНеттоКг,
	        |	ЕСТЬNULL(влКомментарийЗаказаКлиента.ЗаказКлиента, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК бит_ЗаказКлиента
	        |ИЗ
	        |	Документ.ПроизводственнаяОперация2_2 КАК ОперацииПереопределяемый
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ВЫРАЗИТЬ(втЗаказыКлиентаВсе.ЗаказКлиента.Комментарий КАК СТРОКА(1024)) КАК бит_КомментарийЗаказаКлиента,
	        |			втЗаказыКлиентаВсе.ЭтапДоп КАК ЭтапДоп,
	        |			втЗаказыКлиентаВсе.ЗаказКлиента КАК ЗаказКлиента
	        |		ИЗ
	        |			втЗаказыКлиентаВсе КАК втЗаказыКлиентаВсе
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОдинЭтапОдинЗаказ КАК втОдинЭтапОдинЗаказ
	        |				ПО втЗаказыКлиентаВсе.ЭтапДоп = втОдинЭтапОдинЗаказ.ЭтапДоп) КАК влКомментарийЗаказаКлиента
	        |		ПО (влКомментарийЗаказаКлиента.ЭтапДоп = ОперацииПереопределяемый.Этап)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОчередностьОперацийВСменномЗадании КАК бит_ОчередностьОперацийВСменномЗадании
	        |		ПО (бит_ОчередностьОперацийВСменномЗадании.Операция = ОперацииПереопределяемый.Ссылка)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ втСерииМассаНетто КАК втСерииМассаНетто
	        |		ПО ОперацииПереопределяемый.Ссылка = втСерииМассаНетто.ПроизводственнаяОперация";
    // }}ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [19.08.2025 16:18:16] -
КонецФункции

Функция ПолучитьТекстЗапросаОперацииРегистр() Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [19.08.2025 16:18:05] +        
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ОперацииПереопределяемый.Этап КАК ЭтапДоп,
	        |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ КАК ЗаказКлиента
	        |ПОМЕСТИТЬ втЗаказыКлиентаВсе
	        |ИЗ
	        |	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК ОперацииПереопределяемый
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	        |		ПО ОперацииПереопределяемый.Этап = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
	        |ГДЕ
	        |	НЕ ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	втЗаказыКлиентаВсе.ЭтапДоп КАК ЭтапДоп,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втЗаказыКлиентаВсе.ЗаказКлиента) КАК ЗаказКлиента
	        |ПОМЕСТИТЬ втОдинЭтапОдинЗаказ
	        |ИЗ
	        |	втЗаказыКлиентаВсе КАК втЗаказыКлиентаВсе
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	втЗаказыКлиентаВсе.ЭтапДоп
	        |
	        |ИМЕЮЩИЕ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втЗаказыКлиентаВсе.ЗаказКлиента) = 1
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОперацииПереопределяемый.Подразделение КАК Подразделение,
	        |	ОперацииПереопределяемый.Этап КАК Этап,
	        |	ОперацииПереопределяемый.Операция КАК Операция,
	        |	ОперацииПереопределяемый.ИдентификаторОперации КАК ИдентификаторОперации,
	        |	ОперацииПереопределяемый.СменноеЗадание КАК СменноеЗадание,
	        |	ОперацииПереопределяемый.Исполнитель КАК Исполнитель,
	        |	ОперацииПереопределяемый.Участок КАК Участок,
	        |	ОперацииПереопределяемый.РабочийЦентр КАК РабочийЦентр,
	        |	ОперацииПереопределяемый.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	        |	ОперацииПереопределяемый.НазначатьНеРанее КАК НазначатьНеРанее,
	        |	ОперацииПереопределяемый.Количество КАК Количество,
	        |	&ВремяВыполнения КАК ВремяВыполнения,
	        |	ОперацииПереопределяемый.ВремяЕдИзм КАК ВремяВыполненияЕдИзм,
	        |	ОперацииПереопределяемый.НарушенПорядокНазначения КАК НарушенПорядокНазначения,
	        |	ОперацииПереопределяемый.Распоряжение КАК Распоряжение,
	        |	ОперацииПереопределяемый.НомерОперации КАК НомерОперации,
	        |	ОперацииПереопределяемый.НомерСледующейОперации КАК НомерСледующейОперации,
	        |	&ПредставлениеЭтапа КАК ПредставлениеЭтапа,
	        |	ЕСТЬNULL(влКомментарийЗаказаКлиента.бит_КомментарийЗаказаКлиента, """") КАК бит_КомментарийЗаказаКлиента,
	        |	ЕСТЬNULL(влКомментарийЗаказаКлиента.ЗаказКлиента, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК бит_ЗаказКлиента
	        |ИЗ
	        |	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК ОперацииПереопределяемый
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ВЫРАЗИТЬ(втЗаказыКлиентаВсе.ЗаказКлиента.Комментарий КАК СТРОКА(1024)) КАК бит_КомментарийЗаказаКлиента,
	        |			втЗаказыКлиентаВсе.ЭтапДоп КАК ЭтапДоп,
	        |			втЗаказыКлиентаВсе.ЗаказКлиента КАК ЗаказКлиента
	        |		ИЗ
	        |			втЗаказыКлиентаВсе КАК втЗаказыКлиентаВсе
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОдинЭтапОдинЗаказ КАК втОдинЭтапОдинЗаказ
	        |				ПО втЗаказыКлиентаВсе.ЭтапДоп = втОдинЭтапОдинЗаказ.ЭтапДоп) КАК влКомментарийЗаказаКлиента
	        |		ПО (влКомментарийЗаказаКлиента.ЭтапДоп = ОперацииПереопределяемый.Этап)";
	// }}ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [19.08.2025 16:18:05] -
КонецФункции

&Перед("Печать")
Процедура бит_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [19.08.2025 16:37:25] +        
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "бит_СменноеЗадание") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"бит_СменноеЗадание",
			НСтр("ru = '(бит) Сменное задание';
				|en = '(bit) Shift task'"),
			СформироватьПечатнуюФормубит_СменноеЗадание(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [19.08.2025 16:37:25] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [18.11.2025 20:29:02] +        
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "бит_ЭтикеткиДляСменногоЗадания") Тогда
	//	
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//		КоллекцияПечатныхФорм,
	//		"бит_Этикетки",
	//		"(бит) Этикетки",
	//		СформироватьЭтикетки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	//	
	//КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [18.11.2025 20:29:02] -
КонецПроцедуры

Функция СформироватьПечатнуюФормубит_СменноеЗадание(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [19.08.2025 16:38:30] +        
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_СменноеЗадание";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СменноеЗадание.ПФ_MXL_бит_СменноеЗадание");
	ОбластьШапка 	   = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаШапка = Макет.ПолучитьОбласть("СтрокаШапка");
	ОбластьПодвал	   = Макет.ПолучитьОбласть("Подвал");
	
	Первый = Истина;
	Для каждого ДокументСменноеЗадание Из МассивОбъектов Цикл
		
		Если ДокументСменноеЗадание.Статус = Перечисления.СтатусыСменныхЗаданий.Формируется Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + ДокументСменноеЗадание + ": Печатная форма не предназначена для документа в статусе 'Формируется'", ДокументСменноеЗадание); 
			Продолжить;
		КонецЕсли;
		Если Первый Тогда
			Первый = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		// Получим ДанныедляПечатибит_СменноеЗадание(Документ);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерДокумента", ДокументСменноеЗадание.Номер);
		СтруктураПараметров.Вставить("ДатаДокумента", Формат(ДокументСменноеЗадание.Дата, "ДФ=dd.MM.yyyy"));
		СтруктураПараметров.Вставить("Смена", ДокументСменноеЗадание.Смена);
		СтруктураПараметров.Вставить("Мастер", ДокументСменноеЗадание.Ответственный);
		
		мДанныхСтроки = Новый Массив;
		Исполнитель = "";
		
		бит_ПолучитьДанныеСтрокиДляСменногоЗадания(ДокументСменноеЗадание, мДанныхСтроки, Исполнитель);
		
		СтруктураПараметров.Вставить("Работник", Исполнитель);
		
		ОбластьШапка.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Для каждого СтруктураТекущейСтроки из мДанныхСтроки Цикл
			ОбластьСтрокаШапка.Параметры.Заполнить(СтруктураТекущейСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрокаШапка);
		КонецЦикла;

		ТабличныйДокумент.Вывести(ОбластьПодвал);
			
	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
		
	Возврат ТабличныйДокумент;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [19.08.2025 16:38:30] -
КонецФункции

//Функция СформироватьЭтикетки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
//	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [18.11.2025 20:30:00] +        
//	
//	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [18.11.2025 20:30:00] -
//КонецФункции    

&После("ДобавитьКомандыПечати")
Процедура бит_ДобавитьКомандыПечати(КомандыПечати)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [19.08.2025 16:39:47] +        
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_СменноеЗадание";
	КомандаПечати.Представление = НСтр("ru = '(бит) Сменное задание';
										|en = '(bit) Shift task'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 4;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [19.08.2025 16:39:47] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [18.11.2025 20:26:55] +        
	//Если ПраваПользователяПовтИсп.ПечатьЭтикетокИЦенников() Тогда
	//	// Этикетки
	//	КомандаПечати = КомандыПечати.Добавить();
	//	КомандаПечати.Обработчик = "УправлениеПечатьюУТКлиент.ПечатьЭтикетокИЦенников";
	//	КомандаПечати.МенеджерПечати = "Документ.СменноеЗадание";
	//	КомандаПечати.Идентификатор = "Этикетки";
	//	КомандаПечати.Представление = НСтр("ru = 'Этикетки';
	//										|en = 'Labels'");
	//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [18.11.2025 20:26:55] -
КонецПроцедуры

//Функция ДанныеДляПечатиЭтикеток(МассивДокументов) Экспорт

////	ДатаЦенообразования = ОбщегоНазначенияУТ.ПолучитьМаксимальнуюДатуДокументов(МассивДокументов);
////	ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(ДатаЦенообразования);

////	Запрос = Новый Запрос;
////	Если ИспользуетсяЦенообразование25 Тогда
////		Запрос.Текст = 
////		"ВЫБРАТЬ
////		|	ПриобретениеТоваровУслугТовары.Номенклатура   КАК Номенклатура,
////		|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
////		|	ПриобретениеТоваровУслугТовары.Серия          КАК Серия,
////		|
////		|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.РозничныйМагазин) ТОГДА
////		|		ЦеныНоменклатуры.Упаковка
////		|	ИНАЧЕ
////		|		ПриобретениеТоваровУслугТовары.Упаковка
////		|	КОНЕЦ КАК Упаковка,
////		|
////		|	МИНИМУМ(ПриобретениеТоваровУслугТовары.НомерСтроки) КАК Порядок,
////		|	СУММА(
////		|		ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.РозничныйМагазин) ТОГДА
////		|			ПриобретениеТоваровУслугТовары.КоличествоУпаковок * (ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1))
////		|		ИНАЧЕ
////		|			ПриобретениеТоваровУслугТовары.КоличествоУпаковок
////		|		КОНЕЦ) КАК Количество
////		|ИЗ
////		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
////		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних КАК ЦеныНоменклатуры
////		|		ПО ЦеныНоменклатуры.Номенклатура     = ПриобретениеТоваровУслугТовары.Номенклатура
////		|		 И ЦеныНоменклатуры.ХарактеристикаЦО = ПриобретениеТоваровУслугТовары.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования
////		|		 И ЦеныНоменклатуры.СерияЦО          = ПриобретениеТоваровУслугТовары.Серия.СерияНоменклатурыДляЦенообразования
////		|		 И ЦеныНоменклатуры.ВидЦены          = ПриобретениеТоваровУслугТовары.Ссылка.Склад.РозничныйВидЦены
////		|	
////		|ГДЕ
////		|	ПриобретениеТоваровУслугТовары.Ссылка В(&МассивДокументов)
////		|
////		|СГРУППИРОВАТЬ ПО
////		|	ПриобретениеТоваровУслугТовары.Номенклатура,
////		|	ПриобретениеТоваровУслугТовары.Характеристика,
////		|	ПриобретениеТоваровУслугТовары.Серия,
////		|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.РозничныйМагазин) ТОГДА
////		|		ЦеныНоменклатуры.Упаковка
////		|	ИНАЧЕ
////		|		ПриобретениеТоваровУслугТовары.Упаковка
////		|	КОНЕЦ
////		|
////		|УПОРЯДОЧИТЬ ПО
////		|	Порядок
////		|;
////		|
////		|////////////////////////////////////////////////////////////////////////////////
////		|ВЫБРАТЬ РАЗЛИЧНЫЕ
////		|	ПриобретениеТоваровУслуг.Организация            КАК Организация,
////		|	ПриобретениеТоваровУслуг.Склад                  КАК Склад,
////		|	ПриобретениеТоваровУслуг.Склад.РозничныйВидЦены КАК ВидЦены
////		|ИЗ
////		|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
////		|ГДЕ
////		|	ПриобретениеТоваровУслуг.Ссылка В(&МассивДокументов)";
////	Иначе
////		Запрос.Текст = 
////		"ВЫБРАТЬ
////		|	ПриобретениеТоваровУслугТовары.Номенклатура   КАК Номенклатура,
////		|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
////		|
////		|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.РозничныйМагазин) ТОГДА
////		|		ЦеныНоменклатуры.Упаковка
////		|	ИНАЧЕ
////		|		ПриобретениеТоваровУслугТовары.Упаковка
////		|	КОНЕЦ КАК Упаковка,
////		|
////		|	МИНИМУМ(ПриобретениеТоваровУслугТовары.НомерСтроки) КАК Порядок,
////		|	СУММА(
////		|		ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.РозничныйМагазин) ТОГДА
////		|			ПриобретениеТоваровУслугТовары.КоличествоУпаковок * (ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1))
////		|		ИНАЧЕ
////		|			ПриобретениеТоваровУслугТовары.КоличествоУпаковок
////		|		КОНЕЦ) КАК Количество
////		|ИЗ
////		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
////		|	
////		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатуры
////		|		ПО ЦеныНоменклатуры.Номенклатура   = ПриобретениеТоваровУслугТовары.Номенклатура
////		|		 И ЦеныНоменклатуры.Характеристика = ПриобретениеТоваровУслугТовары.Характеристика
////		|		 И ЦеныНоменклатуры.ВидЦены        = ПриобретениеТоваровУслугТовары.Ссылка.Склад.РозничныйВидЦены
////		|	
////		|ГДЕ
////		|	ПриобретениеТоваровУслугТовары.Ссылка В(&МассивДокументов)
////		|
////		|СГРУППИРОВАТЬ ПО
////		|	ПриобретениеТоваровУслугТовары.Номенклатура,
////		|	ПриобретениеТоваровУслугТовары.Характеристика,
////		|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.РозничныйМагазин) ТОГДА
////		|		ЦеныНоменклатуры.Упаковка
////		|	ИНАЧЕ
////		|		ПриобретениеТоваровУслугТовары.Упаковка
////		|	КОНЕЦ
////		|
////		|УПОРЯДОЧИТЬ ПО
////		|	Порядок
////		|;
////		|
////		|////////////////////////////////////////////////////////////////////////////////
////		|ВЫБРАТЬ РАЗЛИЧНЫЕ
////		|	ПриобретениеТоваровУслуг.Организация            КАК Организация,
////		|	ПриобретениеТоваровУслуг.Склад                  КАК Склад,
////		|	ПриобретениеТоваровУслуг.Склад.РозничныйВидЦены КАК ВидЦены
////		|ИЗ
////		|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
////		|ГДЕ
////		|	ПриобретениеТоваровУслуг.Ссылка В(&МассивДокументов)";
////	КонецЕсли;
////	
////	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
////		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
////			"ПриобретениеТоваровУслугТовары.Упаковка",
////			"ПриобретениеТоваровУслугТовары.Номенклатура"));
////	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки2",
////		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
////			"ЦеныНоменклатуры.Упаковка",
////			"ЦеныНоменклатуры.Номенклатура"));
////	
////	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
////	
////	МассивРезультатов = Запрос.ВыполнитьПакет();
////	
////	ТаблицаРеквизитыДокументов = МассивРезультатов[1].Выгрузить();
////	МассивОрганизаций = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ТаблицаРеквизитыДокументов, "Организация");
////	МассивСкладов     = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ТаблицаРеквизитыДокументов, "Склад");
////	МассивВидовЦен    = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ТаблицаРеквизитыДокументов, "ВидЦены");
////	
////	// Подготовка структуры действий для обработки печати ценников и этикеток
////	СтруктураДействий = Новый Структура;
////	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", ?(МассивОрганизаций.Количество() = 1, МассивОрганизаций[0], Неопределено));
////	СтруктураДействий.Вставить("ЗаполнитьСклад",       ?(МассивСкладов.Количество() = 1,     МассивСкладов[0],     МассивСкладов));
////	СтруктураДействий.Вставить("ЗаполнитьВидЦены",     ?(МассивВидовЦен.Количество() = 1,    МассивВидовЦен[0],    Неопределено));
////	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Истина);
////	СтруктураДействий.Вставить("УстановитьРежимПечатиИзДокумента");
////	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЭтикеток");
////	СтруктураДействий.Вставить("ЗаполнитьКоличествоЭтикетокПоДокументу");
////	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
////	
////	// Подготовка данных для заполнения табличной части обработки печати ценников и этикеток.
////	СтруктураРезультат = Новый Структура;
////	СтруктураРезультат.Вставить("Товары", МассивРезультатов[0].Выгрузить());
////	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
////	СтруктураРезультат.Вставить("Дата",              ДатаЦенообразования);
////	
////	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
////	
//КонецФункции


Процедура бит_ПолучитьДанныеСтрокиДляСменногоЗадания(ДокументСменноеЗадание, мДанных, Исполнитель)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [19.08.2025 17:37:48] +        
	Запрос = Новый Запрос(Документы.СменноеЗадание.ПолучитьТекстЗапросаОперацииДокумент() + " 
	| ГДЕ
	|	ОперацииПереопределяемый.СменноеЗадание = &СменноеЗадание
	|	И ВЫБОР КОГДА &ОтборПодразделения ТОГДА ОперацииПереопределяемый.Подразделение = &Подразделение ИНАЧЕ Истина КОНЕЦ");
	Запрос.УстановитьПараметр("СменноеЗадание"		, ДокументСменноеЗадание);
	Запрос.УстановитьПараметр("Подразделение"		, ДокументСменноеЗадание.Подразделение);
	Запрос.УстановитьПараметр("ОтборПодразделения"	, ЗначениеЗаполнено(ДокументСменноеЗадание.Подразделение)); 
	Запрос.УстановитьПараметр("ПредставлениеЭтапа"	, ""); 
	Запрос.УстановитьПараметр("ВремяВыполнения"		, ""); 
    ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Сортировать("бит_Очередность");
	
	тИсполнитель = ТЗ.Скопировать(, "Исполнитель");
	тИсполнитель.Свернуть("Исполнитель");
	Если тИсполнитель.Количество() = 1 Тогда
		Исполнитель = тИсполнитель[0].Исполнитель;
	КонецЕсли;
	
	мДанных = Новый Массив;
	Для каждого стр из ТЗ Цикл     
		
		Операция = стр.ссылка;       
		
		//Для каждого СтрокаОперации из Операция.ВыходныеИзделия Цикл // исправление после сквозного задача 2
			стрДанных = Новый Структура;
			стрДанных.Вставить("МашинаХод", стр.ВидРабочегоЦентра); // ЛТ5.36 поменял с РЦ на ВРЦ
			стрДанных.Вставить("Очередность", стр.бит_Очередность);   
			стрДанных.Вставить("ТМЦ", стр.Этап.Спецификация.ОсновноеИзделиеНоменклатура);                                       
			стрДанных.Вставить("КЗК", ?(ЗначениеЗаполнено(стр.бит_КомментарийЗаказаКлиента), стр.бит_КомментарийЗаказаКлиента, стрДанных.ТМЦ.бит_СтандартныйТипТары)); 
			//стрДанных.Вставить("Тара", соотвТарыОперации.Получить(СтрокаОперации.Номенклатура)); // исправление после сквозного задача 2 
			стрДанных.Вставить("Тара", ЗаполнитьБит_тара(Операция));
			стрДанных.Вставить("ПланПоЗаказам", бит_ПолучитьПланПоЗаказам(стр.Этап));    
			стрДанных.Вставить("КолвоХодов", Окр(1 / ТЗ.НайтиСтроки(Новый Структура("ВидрабочегоЦентра", стрДанных.МашинаХод)).Количество(), 3));
			
			//НормаВыработки = стр.Операция.бит_НормаВыработки * 1000; // указывается в тоннах а нужны кг  // исправление после сквозного задача 3
			//стрДанных.Вставить("ПланЗаСмену", Окр(НормаВыработки * стрДанных.КолвоХодов, 3));  // исправление после сквозного задача 3
			стрДанных.Вставить("ПланЗаСмену", Операция.бит_КоличествоПлан); // исправление после сквозного задача 3
			
			мДанных.Добавить(стрДанных);
		//КонецЦикла;
	КонецЦикла;                     
	// }}ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [19.08.2025 17:37:48] -
КонецПроцедуры

&НаСервере
Функция ЗаполнитьБит_тара(Операция)
	// {{ПервыйБИТ ЛистТребований [Исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 5:43:11] + 
	// задача 2
	// взято с формы производственной операции (расширение)  
	Перем ЗаказКлиента;
	//Соответствие = Новый Соответствие;
	Тара = Справочники.Номенклатура.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Операция.Этап) Тогда 
	
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ КАК НазначениеЗаказ
		                      |ИЗ
		                      |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
		                      |ГДЕ
		                      |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &Этап
		                      |	И ЭтапПроизводства2_2ВыходныеИзделия.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)"); 
		Запрос.УстановитьПараметр("Этап", Операция.Этап);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Количество() = 1 Тогда 
			Результат.Следующий();
			ЗаказКлиента = Результат.НазначениеЗаказ; 
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказКлиента) и ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда        
		ТоварыЗаказа = ЗаказКлиента.Товары.Выгрузить(, "Номенклатура, бит_Тара");
		Для каждого стр из Операция.ВыходныеИзделия Цикл
			СтрокаТоваровЗаказа = ТоварыЗаказа.Найти(стр.Номенклатура, "Номенклатура");
			Если СтрокаТоваровЗаказа <> Неопределено Тогда
				//Соответствие.Вставить(стр.Номенклатура, СтрокаТоваровЗаказа.бит_Тара);
				Если ЗначениеЗаполнено(СтрокаТоваровЗаказа.бит_Тара) Тогда
					Тара = СтрокаТоваровЗаказа.бит_Тара;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого стр из Операция.ВыходныеИзделия Цикл
			Если ЗначениеЗаполнено(стр.Номенклатура.бит_СтандартныйТипТары) Тогда
				Тара = стр.Номенклатура.бит_СтандартныйТипТары;
				//Соответствие.Вставить(стр.Номенклатура, стр.Номенклатура.бит_СтандартныйТипТары);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Тара; 
	// }}ПервыйБИТ ЛистТребований [Исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 5:43:11] -
КонецФункции

Функция бит_ПолучитьПланПоЗаказам(Этап)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [19.08.2025 17:55:27] +   
	ЕдиницаКГ = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("166");
	Количество = 0;
	Для каждого стр Из Этап.ВыходныеИзделия Цикл
		Если стр.Произведено Тогда
			Продолжить;
		КонецЕсли;
		ЕдиницаИзмерения = ?(ЗначениеЗаполнено(стр.Упаковка), стр.Упаковка, стр.Номенклатура.ЕдиницаИзмерения);
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "ТипИзмеряемойВеличины") <> Перечисления.ТипыИзмеряемыхВеличин.Вес Тогда
			Продолжить;
		КонецЕсли;
		КоэффициентКГ = 1 / Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ЕдиницаКГ, стр.Номенклатура);
		Количество = Количество + КоэффициентКГ * стр.Количество;
	КонецЦикла;        
	
	Возврат Количество;
    // }}ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [19.08.2025 17:55:27] -
КонецФункции
#КонецЕсли
